In [830]:
import pandas as pd
import numpy as np

# Задание 1.1

In [831]:
choco = pd.read_excel('Test for Marketing Analyst.xlsx', sheet_name = 'Данные к Заданию 1')

In [832]:
choco.head()

         users    Месяц  Кол-во заказов     city     Точка заведения
0  77060876181  Декабрь              22   Алматы  Burger King Глобус
1  77026047434   Ноябрь              19   Алматы   Burger King Арман
2  77081501337   Ноябрь              18  Шымкент         Три Самурая
3  77057164908   Ноябрь              17   Алматы   Burger King Арман
4  77017442374  Октябрь              16   Алматы  Burger King Глобус

In [833]:
choco.columns = ['users', 'month', 'cnt', 'city', 'point_of_rest']

In [834]:
choco

             users    month  cnt     city        point_of_rest
0      77060876181  Декабрь   22   Алматы   Burger King Глобус
1      77026047434   Ноябрь   19   Алматы    Burger King Арман
2      77081501337   Ноябрь   18  Шымкент          Три Самурая
3      77057164908   Ноябрь   17   Алматы    Burger King Арман
4      77017442374  Октябрь   16   Алматы   Burger King Глобус
...            ...      ...  ...      ...                  ...
19957  79132138548  Октябрь    1   Алматы  Burger King Максима
19958  79168804858  Октябрь    1   Алматы    Burger King Арман
19959  79168804858  Октябрь    1   Алматы                Gippo
19960  79529260138  Октябрь    1   Астана            Чибо Сано
19961  79654015053   Ноябрь    1   Алматы            Чибо Сано

[19962 rows x 5 columns]

In [835]:
choco_one_order_oct = choco.query('cnt ==1 and month=="Октябрь"')

In [836]:
cross_table = pd.pivot_table(choco_one_order_oct, index = 'city', values = 'users', aggfunc='count')

In [837]:
cross_table

           users
city
Алматы      3326
Астана      1386
Атырау        34
Караганда     89
Каскелен       8
Павлодар     106
Шымкент       27

In [838]:
cross_table.columns = ['percent_per_oct']

In [839]:
cross_table['percent_per_oct'] = choco.query('cnt ==1 and month=="Октябрь"').groupby('city')['users'].count() / choco.query(' month=="Октябрь"').groupby('city')['users'].count()

In [840]:
cross_table['percent_per_nov'] = choco.query('cnt ==1 and month=="Ноябрь"').groupby('city')['users'].count() / choco.query(' month=="Ноябрь"').groupby('city')['users'].count()

In [841]:
cross_table['percent_per_dec'] = choco.query('cnt ==1 and month=="Декабрь"').groupby('city')['users'].count() / choco.query(' month=="Декабрь"').groupby('city')['users'].count()

In [842]:
cross_table

           percent_per_oct  percent_per_nov  percent_per_dec
city
Алматы            0.787219         0.752846         0.764894
Астана            0.857143         0.834163         0.839220
Атырау            0.918919         0.906977         0.914894
Караганда         0.927083         0.897436         0.871560
Каскелен          0.727273         1.000000         0.916667
Павлодар          0.929825         0.898438         0.907216
Шымкент           0.843750         0.777778         0.800000

In [843]:
cross_table['differ'] = abs(cross_table['percent_per_oct']-cross_table['percent_per_nov'])

In [844]:
cross_table

           percent_per_oct  percent_per_nov  percent_per_dec    differ
city
Алматы            0.787219         0.752846         0.764894  0.034373
Астана            0.857143         0.834163         0.839220  0.022980
Атырау            0.918919         0.906977         0.914894  0.011942
Караганда         0.927083         0.897436         0.871560  0.029647
Каскелен          0.727273         1.000000         0.916667  0.272727
Павлодар          0.929825         0.898438         0.907216  0.031387
Шымкент           0.843750         0.777778         0.800000  0.065972

In [845]:
cross_table['res'] = cross_table['percent_per_dec'] + cross_table['differ']

In [846]:
cross_table

,percent_per_oct,percent_per_nov,percent_per_dec,differ,res
city,,,,,
Алматы,0.787219,0.752846,0.764894,0.034373,0.799267
Астана,0.857143,0.834163,0.839220,0.022980,0.862199
Атырау,0.918919,0.906977,0.914894,0.011942,0.926836
Караганда,0.927083,0.897436,0.871560,0.029647,0.901207
Каскелен,0.727273,1.000000,0.916667,0.272727,1.189394
Павлодар,0.929825,0.898438,0.907216,0.031387,0.938604
Шымкент,0.843750,0.777778,0.800000,0.065972,0.865972

# Задание 1.2

In [847]:
new_list_2 = pd.DataFrame(data=choco['users'].value_counts()).query('users==2')

In [848]:
ab_2 = list(new_list_2.index)

In [849]:
new_list = pd.DataFrame(data=choco['users'].value_counts()).query('users==1')

In [850]:
ab = list(new_list.index)

In [851]:
new_users = choco.query('users in @ab or month == "Октябрь" or (users not in @ab  and users in @ab_2 and month=="Ноябрь" )')

In [852]:
new_users

             users    month  cnt    city        point_of_rest
0      77060876181  Декабрь   22  Алматы   Burger King Глобус
4      77017442374  Октябрь   16  Алматы   Burger King Глобус
5      77057164908  Октябрь   16  Алматы    Burger King Арман
14     77007633588  Октябрь   12  Алматы   Burger King Восток
21     77076016003   Ноябрь   11  Алматы            Чибо Сано
...            ...      ...  ...     ...                  ...
19957  79132138548  Октябрь    1  Алматы  Burger King Максима
19958  79168804858  Октябрь    1  Алматы    Burger King Арман
19959  79168804858  Октябрь    1  Алматы                Gippo
19960  79529260138  Октябрь    1  Астана            Чибо Сано
19961  79654015053   Ноябрь    1  Алматы            Чибо Сано

[15079 rows x 5 columns]

In [853]:
new_oct = new_users.query('cnt ==1 and month=="Октябрь"')

In [854]:
new = pd.pivot_table(new_oct, index = 'city', values = 'users', aggfunc='count')

In [855]:
new['percent_per_oct'] = new_users.query('cnt ==1 and month=="Октябрь"').groupby('city')['users'].count() / new_users.query(' month=="Октябрь"').groupby('city')['users'].count()

In [856]:
new['percent_per_nov'] = new_users.query('cnt ==1 and month=="Ноябрь"').groupby('city')['users'].count() / new_users.query(' month=="Ноябрь"').groupby('city')['users'].count()

In [857]:
new['percent_per_dec'] = new_users.query('cnt ==1 and month=="Декабрь"').groupby('city')['users'].count() / new_users.query(' month=="Декабрь"').groupby('city')['users'].count()

In [858]:
new['differ'] = abs(new['percent_per_oct']-new['percent_per_nov'])

In [859]:
new['res'] = new['percent_per_dec'] + new['differ']

In [860]:
new

,users,percent_per_oct,percent_per_nov,percent_per_dec,differ,res
city,,,,,,
Алматы,3326,0.787219,0.825561,0.877735,0.038342,0.916078
Астана,1386,0.857143,0.890462,0.915284,0.033319,0.948603
Атырау,34,0.918919,0.904762,0.945946,0.014157,0.960103
Караганда,89,0.927083,0.903509,0.925000,0.023575,0.948575
Каскелен,8,0.727273,1.000000,0.900000,0.272727,1.172727
Павлодар,106,0.929825,0.917355,0.935065,0.012469,0.947534
Шымкент,27,0.843750,0.779412,0.883721,0.064338,0.948059

In [861]:
new_users_3 = list(new_users.index)

In [862]:
old_users = choco.query('index not in @new_users_3')

In [863]:
old_users

             users    month  cnt     city            point_of_rest
1      77026047434   Ноябрь   19   Алматы        Burger King Арман
2      77081501337   Ноябрь   18  Шымкент              Три Самурая
3      77057164908   Ноябрь   17   Алматы        Burger King Арман
6      77057164908  Декабрь   16   Алматы        Burger King Арман
7      77058174933   Ноябрь   16   Астана     Burger King Silk Way
...            ...      ...  ...      ...                      ...
19894  77789542780  Декабрь    1   Астана  Burger King Keruen City
19913  77789622188  Декабрь    1   Астана                      KFC
19920  77789666926  Декабрь    1   Астана  Burger King Keruen City
19925  77789712777  Декабрь    1   Алматы       Burger King Восток
19933  77789804836  Декабрь    1   Алматы                    Gippo

[4883 rows x 5 columns]

In [864]:
old_nov = old_users.query('cnt ==1 and month=="Ноябрь"')

In [865]:
old = pd.pivot_table(old_nov, index = 'city', values = 'users', aggfunc='count')

In [866]:
old.columns = ['percent_per_nov']

In [867]:
old['percent_per_nov'] = old_users.query('cnt ==1 and month=="Ноябрь"').groupby('city')['users'].count() / old_users.query(' month=="Ноябрь"').groupby('city')['users'].count()

In [868]:
old['percent_per_dec'] = old_users.query('cnt ==1 and month=="Декабрь"').groupby('city')['users'].count() / old_users.query(' month=="Декабрь"').groupby('city')['users'].count()

In [869]:
old['dif'] = old['percent_per_dec'] + abs(old['percent_per_nov'] - old['percent_per_dec'])

In [870]:
old

           percent_per_nov  percent_per_dec       dif
city
Алматы            0.566691         0.660816  0.754941
Астана            0.595300         0.723404  0.851508
Атырау            1.000000         0.800000  1.000000
Караганда         0.666667         0.724138  0.781609
Павлодар          0.571429         0.800000  1.028571
Шымкент           0.769231         0.666667  0.769231

# Задание 1.3- 1.4

Наиболее качественная база пользователей у Burger King

In [871]:
cross_table_3 = pd.pivot_table(choco, index = ['point_of_rest', 'city'], values = 'cnt', aggfunc='mean').sort_values(by = 'cnt')

In [872]:
cross_table_3

                                          cnt
point_of_rest             city
Три Самурая               Уральск    1.000000
                          Астана     1.000000
                          Караганда  1.082353
                          Алматы     1.114155
KFC                       Караганда  1.128889
Три Самурая               Каскелен   1.129032
KFC                       Павлодар   1.138643
                          Астана     1.142162
Три Самурая               Атырау     1.149606
Gippo                     Алматы     1.240538
                          Астана     1.255376
Чибо Сано                 Астана     1.286219
Gippo                     Шымкент    1.316547
Burger King Москва        Алматы     1.321503
Burger King Конгресс Холл Астана     1.380653
Burger King ADK           Алматы     1.391081
Burger King Максима       Алматы     1.393617
Burger King City Center   Алматы     1.397924
Чибо Сано                 Алматы     1.403819
Burger King Keruen City   Астана     1.416572
Burger King Silk Way      Астана     1.441860
Burger King Mega          Алматы     1.482652
Burger King Глобус        Алматы     1.498024
Burger King Арман         Алматы     1.522242
Burger King Восток        Алматы     1.586187
Zheka`s doner house       Караганда  1.666667
Три Самурая               Шымкент    1.772727

Сравним среднее количество заказов в Астане и Алматы

In [873]:
choco.query('point_of_rest.str.contains("Burger King")and city == "Астана"', engine='python')['cnt'].mean()

1.4059656218402428

In [874]:
choco.query('point_of_rest.str.contains("Burger King")and city == "Алматы"', engine='python')['cnt'].mean()

1.4865995554974507

В Алматы среднее количество заказов выше

In [875]:
choco.query('point_of_rest.str.contains("Burger King")and city == "Алматы"', engine='python').groupby('point_of_rest')['cnt'].mean().sort_values()

point_of_rest
Burger King Москва         1.321503
Burger King ADK            1.391081
Burger King Максима        1.393617
Burger King City Center    1.397924
Burger King Mega           1.482652
Burger King Глобус         1.498024
Burger King Арман          1.522242
Burger King Восток         1.586187
Name: cnt, dtype: float64

Лидером оказался: Burger King Восток

# Задание 2

In [876]:
choco_2 = pd.read_excel('Test for Marketing Analyst.xlsx', sheet_name = 'Данные к Заданию 2')

In [877]:
choco_2.columns = ['users', 'month', 'cnt', 'city']

In [878]:
choco_2

            users    month  cnt     city
0     77550509055   Январь    1   Алматы
1     77559020355   Январь    1  Шымкент
2     77050513951   Январь    2   Алматы
3     77020502298   Январь    1   Алматы
4     77067037070   Январь    1   Алматы
...           ...      ...  ...      ...
7949  77789555370  Декабрь    1   Атырау
7950  77789527552  Декабрь    1   Атырау
7951  77789955905  Декабрь    2   Атырау
7952  77789827896  Декабрь    1   Атырау
7953  77789955528  Декабрь    1   Атырау

[7954 rows x 4 columns]

In [879]:
active_april = choco_2.query('(month=="Февраль" and cnt>=1) or (month=="Март" and cnt>=1) or (month=="Апрель" and cnt>=1)').groupby('month')['cnt'].sum()

In [880]:
active_may = choco_2.query('(month == ["Февраль", "Март", "Апрель","Май"])').groupby('month')['cnt'].sum()

In [881]:
choco_jan = choco_2.query('month=="Февраль"')

In [882]:
choco_feb = choco_2.query('month==["Февраль","Январь"]')

In [883]:
choco_feb_jan = choco_2.query('month==["Февраль","Январь","Март"]')

In [884]:
choco_feb_jan_mar = choco_2.query('month==["Февраль","Январь","Март"]')

In [885]:
choco_feb_jan_mar_apr = choco_2.query('month==["Февраль","Январь","Март", "Апрель"]')

In [886]:
choco_feb_jan_mar_apr_july = choco_2.query('month==["Февраль","Январь","Март", "Апрель", "Июль"]')

In [887]:
choco_feb_jan_mar_apr_july_aug = choco_2.query('month==["Февраль","Январь","Март", "Апрель", "Июль", "Август"]')

In [888]:
choco_feb_jan_mar_apr_july_aug_sep = choco_2.query('month==["Февраль","Январь","Март", "Апрель", "Июль", "Август", "Сентябрь"]')

In [889]:
choco_feb_jan_mar_apr_july_aug_sep_oct = choco_2.query('month==["Февраль","Январь","Март", "Апрель", "Июль", "Август", "Сентябрь", "Октябрь"]')

In [890]:
choco_feb_jan_mar_apr_july_aug_sep_oct_nov = choco_2.query('month==["Февраль","Январь","Март", "Апрель", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь"]')

In [891]:
new_jan= choco_2.query('(month=="Январь" and cnt>=1) and (users not in @choco_jan) ').groupby('month')['cnt'].sum()

In [892]:
new_feb= choco_2.query('(month=="Февраль" and cnt>=1) and (users not in @choco_feb) ').groupby('month')['cnt'].sum()

In [893]:
new_march= choco_2.query('(month=="Март" and cnt>=1) and (users not in @choco_feb_jan) ').groupby('month')['cnt'].sum()

In [894]:
new_april = choco_2.query('(month=="Апрель" and cnt>=1) and (users not in @choco_feb_jan_mar) ').groupby('month')['cnt'].sum()

In [895]:
new_july = choco_2.query('(month=="Июль" and cnt>=1) and (users not in @choco_feb_jan_mar_apr) ').groupby('month')['cnt'].sum()

In [896]:
new_august =  choco_2.query('(month=="Август" and cnt>=1) and (users not in @choco_feb_jan_mar_apr_july) ').groupby('month')['cnt'].sum()

In [897]:
new_sep =  choco_2.query('(month=="Сентябрь" and cnt>=1) and (users not in @choco_feb_jan_mar_apr_july_aug) ').groupby('month')['cnt'].sum()

In [898]:
new_oct =  choco_2.query('(month=="Октябрь" and cnt>=1) and (users not in @choco_feb_jan_mar_apr_july_aug_sep) ').groupby('month')['cnt'].sum()

In [899]:
new_nov =  choco_2.query('(month=="Ноябрь" and cnt>=1) and (users not in @choco_feb_jan_mar_apr_july_aug_sep_oct) ').groupby('month')['cnt'].sum()

In [900]:
new_dec =  choco_2.query('(month=="Декабрь" and cnt>=1) and (users not in @choco_feb_jan_mar_apr_july_aug_sep_oct_nov) ').groupby('month')['cnt'].sum()

In [903]:
cross_table_4 = pd.pivot_table(choco_2, index = 'month', values = 'users', aggfunc='count')

In [904]:
del cross_table_4['users']

In [905]:
cross_table_4

Empty DataFrame
Columns: []
Index: [Август, Апрель, Декабрь, Июль, Март, Ноябрь, Октябрь, Сентябрь, Февраль, Январь]

In [906]:
cross_table_4['active'] = active_april

In [907]:
cross_table_4.loc[['Январь'], ['new']] = new_jan

In [908]:
cross_table_4.loc[['Февраль'], ['new']] = new_feb

In [909]:
cross_table_4.loc[['Март'], ['new']] = new_march

In [910]:
cross_table_4.loc[['Апрель'], ['new']] = new_april

In [911]:
cross_table_4.loc[['Июль'], ['new']] = new_july

In [912]:
cross_table_4.loc[['Август'], ['new']] = new_august

In [913]:
cross_table_4.loc[['Сентябрь'], ['new']] = new_sep

In [914]:
cross_table_4.loc[['Октябрь'], ['new']] = new_oct

In [915]:
cross_table_4.loc[['Ноябрь'], ['new']] = new_nov

In [916]:
cross_table_4.loc[['Декабрь'], ['new']] = new_dec

In [918]:
cross_table_4

          active     new
month
Август       NaN  1779.0
Апрель      77.0    77.0
Декабрь      NaN  1765.0
Июль         NaN  1347.0
Март       607.0   607.0
Ноябрь       NaN  1477.0
Октябрь      NaN  1536.0
Сентябрь     NaN  1924.0
Февраль    623.0   623.0
Январь       NaN   660.0